app/controllers/reviews_controller.rb

INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('revenge', 8, '復讐したくなった', 1, '2016-03-06 03:29:57', '2016-03-06 03:29:57')
---
  def create
    # Review.create(create_params)
    Review.create(create_params)