app/views/products/index.html.erb

                      <!-- 作品に紐づくレビューをすべて取得する -->
                      <% reviews = product.reviews.all %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1