app/views/products/show.html.erb

              <!-- ここに繰り返し処理を入れる -->
              <% @product.reviews.each do |review| %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1